9/data/attachments/59afe3087152a3f6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_939e287c-39e9-4206-bdff-c75e5898395a</nif:username>
            <nif:friendToBeAdded>Carolyn_responsibility_Friend_56804_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>